Tekla.Structures.DialogInternal.dotdiaAttributeValue_t
Attribute value.

Tekla.Structures.DialogInternal.dotdiaAttributeValue_t.dialogName
The name of the dialog.

Tekla.Structures.DialogInternal.dotdiaAttributeValue_t.type
Data type.

Tekla.Structures.DialogInternal.dotdiaAttributeValue_t.intValue
Integer value.

Tekla.Structures.DialogInternal.dotdiaAttributeValue_t.doubleValue
Double value.

Tekla.Structures.DialogInternal.dotdiaAttributeValue_t.stringValue
String value.